tutorials/conducting-walls/fluid-openfoam/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0.1 0.1 0.0)
    (2.1 0.1 0.0)
    (2.1 2.1 0.0)
    (0.1 2.1 0.0)

    (0.1 0.1 20.0)
    (2.1 0.1 20.0)
    (2.1 2.1 20.0)
    (0.1 2.1 20.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 10) simpleGrading (1 1 1)
);

boundary
(

    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    top
    {
        type wall;
        faces
        (
            (2 3 7 6)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (1 0 4 5)
        );
    }

    right
    {
        type wall;
        faces
        (
            (2 1 5 6)
        );
    }

    left
    {
        type wall;
        faces
        (
            (0 3 7 4)
        );
    }
);
