tutorials/conducting-walls/fluid-openfoam/0/B
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      B;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -2 0 0 -1 0];

internalField   uniform (1 0 0);

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
	type		zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    left
    {
	type		zeroGradient;
    }
}

// ************************************************************************* //
