tutorials/conducting-walls/fluid-openfoam/0/phiE
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      phiE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0.1;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            fixedValue;
        value           uniform 0.1;
    }
    bottom
    {
        type            fixedGradient;
        gradient        uniform 0;
    }
    left
    {
        type            fixedValue; //zeroGradient;
	value		uniform 0.1;
    }
    right
    {
        type            fixedGradient; //zeroGradient;
	gradient	uniform 0;
    }
}

// ************************************************************************* //
